In [1]:
import numpy as np
import pandas as pd

In [2]:
maasSozluk ={"Isim":["Deniz","Zeynep","Mehmet","Ahmet"],
             "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas":[200,300,400,500]
             }

In [3]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [4]:
maasDataFrame

     Isim  Departman  Maas
0   Deniz    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [5]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [6]:
maasDataFrame["Departman"].unique() #tekilleri getir

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [7]:
maasDataFrame["Departman"].nunique() #kaç tane tekil var

3

In [8]:
maasDataFrame["Departman"].value_counts() # her birinden kaçtane var

Yazılım      2
Pazarlama    1
Satış        1
Name: Departman, dtype: int64

In [9]:
#fonksiyon ile uygulama
def brutonet(maas):
    return maas * 0.66

In [10]:
maasDataFrame["Maas"].apply(brutonet)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [11]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [12]:
#pivot table

In [13]:
yeniBirVeri = {"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson"],
               "Karakter Ismi":["Cartman","Kenny","Homer","Bart"],
               "Karakter Yas":[9,10,50,20]
               }

In [14]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [15]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [16]:
karakterDF.pivot_table(values="Karakter Yas",index = ["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [17]:
yeniBirVeri = {"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
               "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
               "Karakter Yas":[9,10,50,20,10]
               }

In [18]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [19]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [20]:
karakterDF.pivot_table(values="Karakter Yas",index = ["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [22]:
karakterDF.pivot_table(values="Karakter Yas",index = ["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10